results/cpu-vs-latency5/memcached/6-2/nsl201.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     2521490 ops,   81797 (avg:   84048) ops/sec, 3.08MB/sec (avg: 3.17MB/sec),  1.17 (avg:  1.14) msec latency

6         Threads
16        Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        7642.22          ---          ---      1.14200       566.49
Gets       76405.80     12705.02     63700.78      1.13800      2679.18
Totals     84048.02     12705.02     63700.78      1.13900      3245.67


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET        -nan    100.00000
---
GET       0.120      0.00009
GET       0.140      0.00031
GET       0.150      0.00035
GET       0.160      0.00065
GET       0.170      0.00092
GET       0.180      0.00148
GET       0.190      0.00297
GET       0.200      0.00423
GET       0.210      0.00541
GET       0.220      0.00707
GET       0.230      0.00903
GET       0.240      0.01344
GET       0.250      0.01623
GET       0.260      0.01885
GET       0.270      0.02042
GET       0.280      0.02216
GET       0.290      0.02452
GET       0.300      0.02722
GET       0.310      0.02949
GET       0.320      0.03167
GET       0.330      0.03346
GET       0.340      0.03656
GET       0.350      0.03953
GET       0.360      0.04284
GET       0.370      0.04712
GET       0.380      0.05178
GET       0.390      0.05728
GET       0.400      0.06204
GET       0.410      0.06640
GET       0.420      0.07032
GET       0.430      0.07600
GET       0.440      0.08219
GET       0.450      0.08734
GET       0.460      0.09362
GET       0.470      0.10016
GET       0.480      0.10688
GET       0.490      0.11430
GET       0.500      0.12163
GET       0.510      0.12843
GET       0.520      0.13681
GET       0.530      0.14628
GET       0.540      0.15801
GET       0.550      0.17180
GET       0.560      0.18724
GET       0.570      0.20561
GET       0.580      0.22969
GET       0.590      0.25866
GET       0.600      0.29613
GET       0.610      0.34089
GET       0.620      0.39128
GET       0.630      0.45838
GET       0.640      0.54637
GET       0.650      0.67485
GET       0.660      0.87924
GET       0.670      1.22754
GET       0.680      1.84616
GET       0.690      2.91211
GET       0.700      4.66334
GET       0.710      7.32679
GET       0.720     11.15679
GET       0.730     16.31768
GET       0.740     22.56010
GET       0.750     29.38205
GET       0.760     36.10523
GET       0.770     42.06701
GET       0.780     46.96541
GET       0.790     50.71522
GET       0.800     53.32815
GET       0.810     55.04923
GET       0.820     56.15484
GET       0.830     56.85377
GET       0.840     57.30473
GET       0.850     57.59672
GET       0.860     57.81188
GET       0.870     57.97657
GET       0.880     58.10701
GET       0.890     58.22472
GET       0.900     58.33304
GET       0.910     58.43312
GET       0.920     58.52997
GET       0.930     58.62411
GET       0.940     58.70604
GET       0.950     58.78474
GET       0.960     58.85485
GET       0.970     58.92744
GET       0.980     59.00579
GET       0.990     59.10317
GET       1.000     60.08828
GET       1.100     63.76555
GET       1.200     78.06366
GET       1.300     81.91067
GET       1.400     82.52689
GET       1.500     85.07861
GET       1.600     85.91439
GET       1.700     86.41504
GET       1.800     87.09006
GET       1.900     87.25205
GET       2.000     87.27774
GET       2.100     87.29672
GET       2.200     87.32159
GET       2.300     87.56201
GET       2.400     88.90219
GET       2.500     92.43257
GET       2.600     96.40257
GET       2.700     98.59407
GET       2.800     99.34055
GET       2.900     99.49473
GET       3.000     99.51981
GET       3.100     99.52666
GET       3.200     99.52980
GET       3.300     99.53307
GET       3.400     99.53730
GET       3.500     99.54271
GET       3.600     99.54865
GET       3.700     99.55702
GET       3.800     99.57727
GET       3.900     99.61369
GET       4.000     99.68729
GET       4.100     99.78017
GET       4.200     99.87510
GET       4.300     99.94350
GET       4.400     99.97736
GET       4.500     99.98931
GET       4.600     99.99367
GET       4.700     99.99459
GET       4.800     99.99485
GET       4.900     99.99507
GET       5.000     99.99546
GET       5.100     99.99603
GET       5.200     99.99712
GET       5.300     99.99782
GET       5.400     99.99825
GET       5.500     99.99847
GET       5.600     99.99895
GET       5.700     99.99908
GET       6.300     99.99913
GET       6.400     99.99921
GET       7.400     99.99930
GET       7.600     99.99935
GET       7.700     99.99948
GET       7.800     99.99961
GET       7.900     99.99987
GET       8.000    100.00000